core/load-test.yaml
config:
    target: https://app.pubpub.org
    # Load the Playwright engine:
    engines:
        playwright: {}
    # Path to JavaScript file that defines Playwright test functions
    processor: "./load-test-flows.ts"
    phases:
        - duration: 60
          arrivalRate: 1
          rampTo: 2
          name: Warm up phase
scenarios:
    - engine: playwright
      testFunction: "loginFlow"